Catalogs/ПЛ_Подписчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_Подписчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выборка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборкаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаВыборки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиВыборки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКонтактнойИнформации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтопЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыКонтактнойИнформации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыКонтактнойИнформацииДополнительно</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеАдресаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_СпособыДоставкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыДоставкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовКонтактнойИнформации</Name>
			<Comment>(Упр) Виды объектов контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>Справочник контрагентов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическиеЛица</Name>
					<Comment>Справочник "Физические лица", контактные лица контрагентов, менеджеры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеКонтакты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПЛ_Подписчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СхемаВыборки = ТекущийОбъект.СхемаВыборки.Получить();
	НастройкиВыборки = ТекущийОбъект.НастройкиВыборки.Получить();
	
	Если СхемаВыборки <> Неопределено Тогда
		АдресСхемыВыборки = ПоместитьВоВременноеХранилище(СхемаВыборки, Новый УникальныйИдентификатор());
	Иначе
		АдресСхемыВыборки = "";
	КонецЕсли;
	Если НастройкиВыборки <> Неопределено Тогда
		АдресНастроекВыборки = ПоместитьВоВременноеХранилище(НастройкиВыборки, Новый УникальныйИдентификатор());
	Иначе
		АдресНастроекВыборки = "";
	КонецЕсли;
	
	ИнициализироватьКомпоновщикНастроекВыборки();
	
	ВидыКИ = ТекущийОбъект.ВидыКонтактнойИнформации.Получить();
	Если ВидыКИ <> Неопределено Тогда
		ВидыКонтактнойИнформации.ЗагрузитьЗначения(ВидыКИ);
	Иначе
		ВидыКонтактнойИнформации.Очистить();
	КонецЕсли;
	
	ВидыКИ = ТекущийОбъект.ВидыКонтактнойИнформацииДополнительно.Получить();
	Если ВидыКИ <> Неопределено Тогда
		ВидыКонтактнойИнформацииДополнительно.ЗагрузитьЗначения(ВидыКИ);
	Иначе
		ВидыКонтактнойИнформацииДополнительно.Очистить();
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыВыборки) Тогда
		КомпоновщикНастроекВыборки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		НастройкиВыборки = ПолучитьИзВременногоХранилища(АдресНастроекВыборки);
		НастройкиВыборки.Отбор.Элементы.Очистить();
		ПЛ_УведомленияОСобытиях.СкопироватьНастройкиКомпоновкиДанных(НастройкиВыборки, КомпоновщикНастроекВыборки.ПолучитьНастройки());
		
		ТекущийОбъект.СхемаВыборки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСхемыВыборки));
		ТекущийОбъект.НастройкиВыборки = Новый ХранилищеЗначения(НастройкиВыборки);
	Иначе
		ТекущийОбъект.СхемаВыборки = Новый ХранилищеЗначения(Неопределено);
		ТекущийОбъект.НастройкиВыборки = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если ВидыКонтактнойИнформации.Количество() Тогда
		ТекущийОбъект.ВидыКонтактнойИнформации = Новый ХранилищеЗначения(ВидыКонтактнойИнформации.ВыгрузитьЗначения());
	Иначе
		ТекущийОбъект.ВидыКонтактнойИнформации = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если ВидыКонтактнойИнформацииДополнительно.Количество() Тогда
		ТекущийОбъект.ВидыКонтактнойИнформацииДополнительно = Новый ХранилищеЗначения(ВидыКонтактнойИнформацииДополнительно.ВыгрузитьЗначения());
	Иначе
		ТекущийОбъект.ВидыКонтактнойИнформацииДополнительно = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.СтраницаКомментарий.Картинка = ?(ЗначениеЗаполнено(Объект.Комментарий), БиблиотекаКартинок.ПЛ_Комментарий, Новый Картинка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		ИзменениеСхемыКомпоновкиДанных(ВыбранноеЗначение);
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСхемыКомпоновкиДанных(СхемаКомпоновкиДанных)
	
	Модифицированность = Истина;
	
	БылиИзменения = Ложь;
	УстановитьСхемуКомпоновкиДанных(АдресСхемыВыборки, СхемаКомпоновкиДанных, Истина, БылиИзменения);
	
	Если БылиИзменения Тогда
		Объект.Выборка = "Произвольная";
		ТекущаяВыборка = "Произвольная";
	КонецЕсли;
	
	ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроекВыборки, АдресСхемыВыборки);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВыборкаПриИзменении(Элемент)
	
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(Объект.Выборка);
	Если ЭлементСписка <> Неопределено Тогда
		Объект.ВыборкаПредставление = ЭлементСписка.Представление;
	Иначе
		Объект.ВыборкаПредставление = "";
	КонецЕсли;
	
	Если Объект.Выборка <> ТекущаяВыборка Тогда
		Если ТекущаяВыборка = "Произвольная" Тогда
			
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ИзменениеПроизвольнойВыборкиЗавершение", ЭтаФорма),
				НСтр("ru='Настройки произвольной выборки будут потеряны. Продолжить?'"),
				РежимДиалогаВопрос.ДаНет);
		Иначе
			ТекущаяВыборка = Объект.Выборка;
			ВыборкаПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПроизвольнойВыборкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущаяВыборка = Объект.Выборка;
		ВыборкаПриИзмененииНаСервере();
	Иначе
		Объект.Выборка = ТекущаяВыборка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыборкаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Выборка)
		И Объект.Выборка <> "Произвольная" Тогда
		
		СКД = Справочники.ПЛ_Подписчики.ПолучитьМакет(Объект.Выборка);
		АдресСхемыВыборки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		АдресНастроекВыборки = ПоместитьВоВременноеХранилище(СКД.НастройкиПоУмолчанию, УникальныйИдентификатор);
		
		ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроекВыборки, АдресСхемыВыборки, АдресНастроекВыборки);
		
	Иначе
		АдресСхемыВыборки = "";
		АдресНастроекВыборки = "";
		
		КомпоновщикНастроекВыборки.Настройки.Отбор.Элементы.Очистить();
	КонецЕсли;
	
	ВидыКонтактнойИнформации.Очистить();
	
	ИнициализироватьОтборВидовКИ();
	УстановитьПодсказкуВыборки();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаВидыКонтактнойИнформацииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыКонтактнойИнформации", ВидыКонтактнойИнформации);
	
	Если Объект.Выборка = "Произвольная" Тогда
		ПараметрыФормы.Вставить("ДоступныеЗначенияКонтактнойИнформации", ДоступныеЗначенияКонтактнойИнформации);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПЛ_Подписчики.Форма.ОтборВидовКонтактнойИнформации",
		ПараметрыФормы,
		ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗавершениеОтборВидовКонтактнойИнформации", ЭтаФорма, "ВидыКИ"),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаВидыКонтактнойИнформацииДополнительноНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыКонтактнойИнформации", ВидыКонтактнойИнформацииДополнительно);
	ПараметрыФормы.Вставить("ДоступныеЗначенияКонтактнойИнформации", ДоступныеЗначенияКонтактнойИнформации);
	
	ОткрытьФорму("Справочник.ПЛ_Подписчики.Форма.ОтборВидовКонтактнойИнформации",
		ПараметрыФормы,
		ЭтаФорма,,,,
		Новый ОписаниеОповещения("ЗавершениеОтборВидовКонтактнойИнформации", ЭтаФорма, "ВидыКИДополнительно"),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаПроверка Тогда
		ЗаполнитьПолеПроверки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПроверкиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеРасшифровки = ПолучитьДанныеРасшифровки(Расшифровка);
	
	Если ЗначениеРасшифровки <> Неопределено
		И ТипЗнч(ЗначениеРасшифровки) <> Тип("Число")
		И ТипЗнч(ЗначениеРасшифровки) <> Тип("Строка") Тогда
		ПоказатьЗначение(, ЗначениеРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РедактироватьСКД(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресСхемыВыборки) Тогда
			ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроекВыборки, АдресСхемыВыборки);
			СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыВыборки)));
			Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Иначе
			Конструктор = Новый КонструкторСхемыКомпоновкиДанных;
		КонецЕСли;
		
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		ПоказатьПредупреждение(,НСтр("ru='Для редактирования схемы компоновки необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ЗаполнитьПолеПроверки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВСервисРассылок(Команда)
	
	Если ВыгрузитьВСервисРассылокНаСервере() Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Данные адресатов выгружены.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВСервисРассылокНаСервере()
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	АдресатыРасширенно = Новый ТаблицаЗначений;
	АдресатыРасширенно.Колонки.Добавить("Адресат");
	АдресатыРасширенно.Колонки.Добавить("Адрес");
	АдресатыРасширенно.Колонки.Добавить("Идентификатор");
	
	Справочники.ПЛ_Подписчики.ЗаполнитьАдресатовПоСпискуРассылки(
		Объект.Ссылка,
		АдресатыРасширенно,
		Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки);
		
	Результат = ПЛ_Рассылки.ЭкспортироватьПодписчиков(Объект, АдресатыРасширенно);
	
	Если Результат <> Неопределено Тогда
		Записать();
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Сообщить(НСтр("ru='Не удалось выгрузить данные. Подробности ошибки см. в журнале регистрации.'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВерсияУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	
	СписокШаблоновВыборки.Загрузить(Справочники.ПЛ_Подписчики.СписокШаблоновВыборки());
	Для каждого Шаблон Из СписокШаблоновВыборки Цикл
		Элементы.Выборка.СписокВыбора.Добавить(Шаблон.Имя, Шаблон.Синоним);
	КонецЦикла;
	Элементы.Выборка.СписокВыбора.Добавить("Произвольная", НСтр("ru='<Произвольная>'"));
	
	ТекущаяВыборка = Объект.Выборка;
	
	ИнициализироватьОтборВидовКИ();
	ИнициализироватьОтборВидовКИДополнительно();
	ИнициализироватьДополнительныеАдресаты();
	ИнициализироватьСтрокиОтборовКИ(ВидыКонтактнойИнформации, СтрокаВидыКонтактнойИнформации);
	ИнициализироватьСтрокиОтборовКИ(ВидыКонтактнойИнформацииДополнительно, СтрокаВидыКонтактнойИнформацииДополнительно);
	
	УстановитьПодсказкуВыборки();
	УправлениеЭлементамиФормы();
	
	Элементы.СтраницаКомментарий.Картинка = ?(ЗначениеЗаполнено(Объект.Комментарий), БиблиотекаКартинок.ПЛ_Комментарий, Новый Картинка);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	ВыборкаЗаполнена = ЗначениеЗаполнено(Объект.Выборка);
	
	Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = ВыборкаЗаполнена;
	Элементы.СтрокаВидыКонтактнойИнформации.Доступность = ВыборкаЗаполнена;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуВыборки()
	
	СтрокаШаблона = СписокШаблоновВыборки.НайтиСтроки(Новый Структура("Имя", Объект.Выборка));
	Если СтрокаШаблона.Количество() Тогда
		Элементы.Выборка.Подсказка = СтрокаШаблона[0].Комментарий;
	Иначе
		Элементы.Выборка.Подсказка = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	ПЛ_УведомленияОСобытиях.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолеПроверки()
	
	РезультатПроверки.Очистить();
	
	//Попытка
		
		// Выборка адресатов
		
		КомпоновщикНастроекВыборки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		АдресНастроекВыборки = ПоместитьВоВременноеХранилище(КомпоновщикНастроекВыборки.ПолучитьНастройки(), УникальныйИдентификатор);
		
		Если ЭтоАдресВременногоХранилища(АдресСхемыВыборки)
			И ЭтоАдресВременногоХранилища(АдресНастроекВыборки) Тогда
			
			СписокАдресатов = ПЛ_УведомленияОСОбытиях.ПолучитьСписокАдресатов("", "", АдресСхемыВыборки, АдресНастроекВыборки);
			КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатов);
		Иначе
			СписокАдресатов = Новый Массив;
			КонтактнаяИнформация = Неопределено;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
			КонтактнаяИнформация = Новый ТаблицаЗначений;
			КонтактнаяИнформация.Колонки.Добавить("Объект");
			КонтактнаяИнформация.Колонки.Добавить("Тип");
			КонтактнаяИнформация.Колонки.Добавить("Вид");
			КонтактнаяИнформация.Колонки.Добавить("Представление");
		КонецЕсли;
		
		Адресаты = Новый ТаблицаЗначений;
		Адресаты.Колонки.Добавить("Ссылка");
		
		Для Инд = 1 По СписокАдресатов.Количество() Цикл
			Адресаты.Добавить();
		КонецЦикла;
		Адресаты.ЗагрузитьКолонку(СписокАдресатов, "Ссылка");
		
		// Дополнительные адресаты
		
		СписокАдресатовДополнительно = Новый Массив;
		СписокАдресатовДополнительноСтрокой = Новый Массив;
		
		Для каждого СтрокаДополнительныеАдресаты Из Объект.ДополнительныеАдресаты Цикл
			Если ТипЗнч(СтрокаДополнительныеАдресаты.Адресат) = Тип("Строка") Тогда
				СписокАдресатовДополнительноСтрокой.Добавить(СтрокаДополнительныеАдресаты.Адресат);
			Иначе
				СписокАдресатовДополнительно.Добавить(СтрокаДополнительныеАдресаты.Адресат);
			КонецЕсли;
		КонецЦикла;
		
		КонтактнаяИнформацияДополнительно = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатовДополнительно);
		
		Если Не ЗначениеЗаполнено(КонтактнаяИнформацияДополнительно) Тогда
			КонтактнаяИнформацияДополнительно = Новый ТаблицаЗначений;
			КонтактнаяИнформацияДополнительно.Колонки.Добавить("ОбъектДополнительно");
			КонтактнаяИнформацияДополнительно.Колонки.Добавить("ТипДополнительно");
			КонтактнаяИнформацияДополнительно.Колонки.Добавить("ВидДополнительно");
			КонтактнаяИнформацияДополнительно.Колонки.Добавить("ПредставлениеДополнительно");
		Иначе
			КонтактнаяИнформацияДополнительно.Колонки.Объект.Имя = "ОбъектДополнительно";
			КонтактнаяИнформацияДополнительно.Колонки.Вид.Имя = "ВидДополнительно";
			КонтактнаяИнформацияДополнительно.Колонки.Тип.Имя = "ТипДополнительно";
			КонтактнаяИнформацияДополнительно.Колонки.Представление.Имя = "ПредставлениеДополнительно";
		КонецЕсли;
		
		АдресатыДополнительно = Новый ТаблицаЗначений;
		АдресатыДополнительно.Колонки.Добавить("СсылкаДополнительно");
		
		Для Инд = 1 По СписокАдресатовДополнительно.Количество() Цикл
			АдресатыДополнительно.Добавить();
		КонецЦикла;
		АдресатыДополнительно.ЗагрузитьКолонку(СписокАдресатовДополнительно, "СсылкаДополнительно");
		
		Для каждого АдресатДополнительноСтрокой Из СписокАдресатовДополнительноСтрокой Цикл
			НоваяСтрокаАдресатыДополнительно = АдресатыДополнительно.Добавить();
			НоваяСтрокаАдресатыДополнительно.СсылкаДополнительно = АдресатДополнительноСтрокой;
		КонецЦикла;
		
		// Вывод в таблицу
		
		СхемаКомпоновкиДанных = Справочники.ПЛ_Подписчики.ПолучитьМакет("КонтактнаяИнформация");
		НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("КонтактнаяИнформация", КонтактнаяИнформация);
		ВнешниеНаборыДанных.Вставить("Адресаты", Адресаты);
		ВнешниеНаборыДанных.Вставить("КонтактнаяИнформацияДополнительно", КонтактнаяИнформацияДополнительно);
		ВнешниеНаборыДанных.Вставить("АдресатыДополнительно", АдресатыДополнительно);
		
		ОтборВидовКИ = Новый Массив;
		Для каждого СтрокаВидКИ Из ВидыКонтактнойИнформации Цикл
			Если ЗначениеЗаполнено(СтрокаВидКИ.Значение) Тогда
				ОтборВидовКИ.Добавить(СтрокаВидКИ.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ОтборВидовКИ.Количество() Тогда
			
			Поле = Новый ПолеКомпоновкиДанных("Вид");
			
			ГруппаОтбора = НастройкиКомпоновки.Структура[0].Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование     = Истина;
			ЭлементОтбора.ЛевоеЗначение     = Поле;
			ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение    = ОтборВидовКИ;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование     = Истина;
			ЭлементОтбора.ЛевоеЗначение     = Поле;
			ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		КонецЕсли;
		
		ОтборВидовКИДополнительно = Новый Массив;
		Для каждого СтрокаВидКИ Из ВидыКонтактнойИнформацииДополнительно Цикл
			Если ЗначениеЗаполнено(СтрокаВидКИ.Значение) Тогда
				ОтборВидовКИДополнительно.Добавить(СтрокаВидКИ.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ОтборВидовКИДополнительно.Количество() Тогда
			
			Поле = Новый ПолеКомпоновкиДанных("ВидДополнительно");
			
			ГруппаОтбора = НастройкиКомпоновки.Структура[1].Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование     = Истина;
			ЭлементОтбора.ЛевоеЗначение     = Поле;
			ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение    = ОтборВидовКИДополнительно;
			
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование     = Истина;
			ЭлементОтбора.ЛевоеЗначение     = Поле;
			ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			НастройкиКомпоновки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", Заголовок);
		КонецЕсли;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, ДанныеРасшифровки);
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
		
		ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(РезультатПроверки);
		ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);
		
	//Исключение
	//
	//КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроекВыборки()
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыВыборки)
		И ЭтоАдресВременногоХранилища(АдресНастроекВыборки) Тогда
		ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроекВыборки, АдресСхемыВыборки, АдресНастроекВыборки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДополнительныеАдресаты()
	
	Если ВерсияУТ = "11" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		Массив.Добавить(Тип("СправочникСсылка.Партнеры"));
		Массив.Добавить(Тип("СправочникСсылка.КонтактныеЛицаПартнеров"));
		Массив.Добавить(Тип("Строка"));
		
		Элементы.ДополнительныеАдресатыАдресат.ОграничениеТипа = Новый ОписаниеТипов(Массив, , );
		
	ИначеЕсли ВерсияУТ = "10" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		Массив.Добавить(Тип("СправочникСсылка.КонтактныеЛица"));
		Массив.Добавить(Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов"));
		Массив.Добавить(Тип("Строка"));
		
		Элементы.ДополнительныеАдресатыАдресат.ОграничениеТипа = Новый ОписаниеТипов(Массив, , );
		
	ИначеЕсли ВерсияУТ = "Розница" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
		Массив.Добавить(Тип("Строка"));
		
		Элементы.ДополнительныеАдресатыАдресат.ОграничениеТипа = Новый ОписаниеТипов(Массив, , );
		
	ИначеЕсли ВерсияУТ = "ЗУП" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		Массив.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
		Массив.Добавить(Тип("Строка"));
		
		Элементы.ДополнительныеАдресатыАдресат.ОграничениеТипа = Новый ОписаниеТипов(Массив, , );
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОтборВидовКИ()
	
	Если ВерсияУТ = "11" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыКонтактнойИнформации"));
		ТипВидовКИ = Новый ОписаниеТипов(Массив);
		
		ВидыКонтактнойИнформации.ТипЗначения = ТипВидовКИ;
		
		ВидРодителя = Неопределено;
		Если Найти(Объект.Выборка, "Партнеры") Тогда
			Выполнить("ВидРодителя = Справочники.ВидыКонтактнойИнформации.СправочникПартнеры");
		ИначеЕсли Найти(Объект.Выборка, "Пользователи") Тогда
			Выполнить("ВидРодителя = Справочники.ВидыКонтактнойИнформации.СправочникПользователи");
		ИначеЕсли Найти(Объект.Выборка, "КонтактныеЛица") Тогда
			Выполнить("ВидРодителя = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров");
		Иначе
			ВидРодителя = Новый Массив;
			Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры)");
			Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПользователи)");
			Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров)");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидРодителя) Тогда
			ДоступныеЗначенияКИ = Новый СписокЗначений;
			ДоступныеЗначенияКИ.ЗагрузитьЗначения(ВидыКонтактнойИнформацииУТ11(ВидРодителя).ВыгрузитьКолонку("ВидКИ"));
			ВидыКонтактнойИнформации.ДоступныеЗначения = ДоступныеЗначенияКИ;
		КонецЕсли;
		
	ИначеЕсли ВерсияУТ = "10" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыКонтактнойИнформации"));
		ТипВидовКИ = Новый ОписаниеТипов(Массив, , );
		
		ВидыКонтактнойИнформации.ТипЗначения = ТипВидовКИ;
		ВидОбъекта = Неопределено;
		Если Найти(Объект.Выборка, "Контрагенты") Тогда
			Выполнить("ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты");
		ИначеЕсли Найти(Объект.Выборка, "Пользователи") Тогда
			Выполнить("ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи");
		ИначеЕсли Найти(Объект.Выборка, "КонтактныеЛица") Тогда
			Выполнить("ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица");
		ИначеЕсли Найти(Объект.Выборка, "КонтактныеЛицаКонтрагентов") Тогда
			Выполнить("ВидОбъекта = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидОбъекта) Тогда
			ДоступныеЗначенияКИ = Новый СписокЗначений;
			ДоступныеЗначенияКИ.ЗагрузитьЗначения(ВидыКонтактнойИнформацииУТ10(ВидОбъекта).ВыгрузитьКолонку("ВидКИ"));
			ВидыКонтактнойИнформации.ДоступныеЗначения = ДоступныеЗначенияКИ;
		КонецЕсли;
		
	ИначеЕсли ВерсияУТ = "ЗУП" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыКонтактнойИнформации"));
		ТипВидовКИ = Новый ОписаниеТипов(Массив);
		
		ВидыКонтактнойИнформации.ТипЗначения = ТипВидовКИ;
		
		ВидРодителя = Неопределено;
		Если Найти(Объект.Выборка, "Пользователи") Тогда
			Выполнить("ВидРодителя = Справочники.ВидыКонтактнойИнформации.СправочникПользователи");
		ИначеЕсли Найти(Объект.Выборка, "Сотрудники") Тогда
			Выполнить("ВидРодителя = Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица");
		Иначе
			ВидРодителя = Новый Массив;
			Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПользователи)");
			Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица)");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидРодителя) Тогда
			ДоступныеЗначенияКИ = Новый СписокЗначений;
			ДоступныеЗначенияКИ.ЗагрузитьЗначения(ВидыКонтактнойИнформацииУТ11(ВидРодителя).ВыгрузитьКолонку("ВидКИ"));
			ВидыКонтактнойИнформации.ДоступныеЗначения = ДоступныеЗначенияКИ;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОтборВидовКИДополнительно()
	
	Если ВерсияУТ = "11" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыКонтактнойИнформации"));
		ТипВидовКИ = Новый ОписаниеТипов(Массив, , );
		
		ВидыКонтактнойИнформацииДополнительно.ТипЗначения = ТипВидовКИ;
		
		ВидРодителя = Новый Массив;
		Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры)");
		Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПользователи)");
		Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров)");
		
		ДоступныеЗначенияКонтактнойИнформации.Загрузить(ВидыКонтактнойИнформацииУТ11(ВидРодителя));
		
	ИначеЕсли ВерсияУТ = "10" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыКонтактнойИнформации"));
		ТипВидовКИ = Новый ОписаниеТипов(Массив, , );
		
		ВидыКонтактнойИнформацииДополнительно.ТипЗначения = ТипВидовКИ;
		
		ВидРодителя = Новый Массив;
		Выполнить("ВидРодителя.Добавить(Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты)");
		Выполнить("ВидРодителя.Добавить(Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи)");
		Выполнить("ВидРодителя.Добавить(Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица)");
		Выполнить("ВидРодителя.Добавить(Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов)");
		//UT10-2429 Кривова
		Выполнить("ВидРодителя.Добавить(Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица)");
		///
		
		ДоступныеЗначенияКонтактнойИнформации.Загрузить(ВидыКонтактнойИнформацииУТ10(ВидРодителя));
		
	ИначеЕсли ВерсияУТ = "ЗУП" Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ВидыКонтактнойИнформации"));
		ТипВидовКИ = Новый ОписаниеТипов(Массив, , );
		
		ВидыКонтактнойИнформацииДополнительно.ТипЗначения = ТипВидовКИ;
		
		ВидРодителя = Новый Массив;
		Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПользователи)");
		Выполнить("ВидРодителя.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица)");
		
		ДоступныеЗначенияКонтактнойИнформации.Загрузить(ВидыКонтактнойИнформацииУТ11(ВидРодителя));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОтборВидовКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Модифицированность = Истина;
		Если ДополнительныеПараметры = "ВидыКИ" Тогда
			ВидыКонтактнойИнформации.ЗагрузитьЗначения(Результат.ВыгрузитьЗначения());
			ИнициализироватьСтрокиОтборовКИ(ВидыКонтактнойИнформации, СтрокаВидыКонтактнойИнформации);
		Иначе
			ВидыКонтактнойИнформацииДополнительно.ЗагрузитьЗначения(Результат.ВыгрузитьЗначения());
			ИнициализироватьСтрокиОтборовКИ(ВидыКонтактнойИнформацииДополнительно, СтрокаВидыКонтактнойИнформацииДополнительно);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИнициализироватьСтрокиОтборовКИ(ВидыКонтактнойИнформации, СтрокаВидыКонтактнойИнформации)
	
	Если ВидыКонтактнойИнформации.Количество() Тогда
		СтрокаВидыКИ = "";
		Для каждого СтрокаСписка Из ВидыКонтактнойИнформации Цикл
			СтрокаВидыКИ = СтрокаВидыКИ + " " + Строка(СтрокаСписка.Значение) + ";";
		КонецЦикла;
		СтрокаВидыКонтактнойИнформации = СтрокаВидыКИ;
	Иначе
		СтрокаВидыКонтактнойИнформации = НСтр("ru='<Все адреса электронной почты и номера телефонов>'")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВидыКонтактнойИнформацииУТ11(Родители)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК ВидКИ,
	|	ВидыКонтактнойИнформации.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Родитель В (&Родители)
	|	И ВидыКонтактнойИнформации.Тип В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	)
	|";
	
	Запрос.УстановитьПараметр("Родители", Родители);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ВидыКонтактнойИнформацииУТ10(Родители)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК ВидКИ,
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации КАК Родитель
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации В (&Родители)
	|	И ВидыКонтактнойИнформации.Тип В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	)
	|";
	
	Запрос.УстановитьПараметр("Родители", Родители);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьСхемуКомпоновкиДанных(АдресПриемник, АдресСхемаИсточник, ПроверятьНаИзменение = Ложь, БылиИзменения = Ложь)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемаИсточник) Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемаИсточник);
	Иначе
		СхемаКомпоновкиДанных = АдресСхемаИсточник;
	КонецЕсли;
	
	Если ПроверятьНаИзменение Тогда
		
		БылиИзменения = Ложь;
		
		Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
			ТекущаяСКД = ПолучитьИзВременногоХранилища(АдресПриемник);
			Если ТипЗнч(ТекущаяСКД) = Тип("СхемаКомпоновкиДанных") Тогда
				Если ПолучитьXML(СхемаКомпоновкиДанных) <> ПолучитьXML(ТекущаяСКД) Тогда
					БылиИзменения = Истина;
				КонецЕсли
			Иначе
				БылиИзменения = Истина;
			КонецЕсли;
		Иначе
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресПриемник);
	Иначе
		АдресПриемник = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьXML(Значение) Экспорт
	
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Запись, Значение);
	Возврат Запись.Закрыть();
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка)
	
	Значение = Неопределено;
	
	Если ТипЗнч(Расшифровка)= Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		
		ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки);
		
		ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			Если ЭлементРасшифровки.ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
				Поля = ЭлементРасшифровки.ПолучитьПоля();
				Если Поля.Количество() > 0 Тогда
					Возврат Поля[0].Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции
